---
kind: property
id: P:Autodesk.Revit.DB.TableSectionData.LastColumnNumber
source: html/bf22ab73-4df3-f90c-302a-0f8858b80077.htm
---
# Autodesk.Revit.DB.TableSectionData.LastColumnNumber Property

The last column in this section of the table.

## Syntax (C#)
```csharp
public int LastColumnNumber { get; }
```